10/data/attachments/2f4d064a64f85b74.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7444482f-8ed0-41ff-ad95-d03ed854b623</nif:username>
            <nif:friendToBeAdded>Daniel_push_Friend_58743_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>